## Staging: integration_test
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 4 to add, 1 to change, 6 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                                  NAME                                   |
|--------|-------------------------------------------------------------------------|
| add    | `module.integration_test.aws_kms_alias.s3_scan_object_queue`            |
|        | `module.integration_test.aws_kms_key.s3_scan_object_queue`              |
|        | `module.integration_test.aws_sqs_queue.s3_scan_object`                  |
|        | `module.integration_test.aws_sqs_queue_policy.s3_scan_object`           |
| delete | `module.integration_test.aws_cloudwatch_log_group.s3_scan_object`       |
|        | `module.integration_test.aws_iam_policy.s3_scan_object`                 |
|        | `module.integration_test.aws_iam_role.s3_scan_object`                   |
|        | `module.integration_test.aws_iam_role_policy_attachment.s3_scan_object` |
|        | `module.integration_test.aws_lambda_function.s3_scan_object`            |
|        | `module.integration_test.aws_lambda_permission.s3_execute`              |
| update | `module.integration_test.aws_s3_bucket_notification.s3_scan_object`     |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
 <= read (data resources)

Terraform will perform the following actions:

  # module.integration_test.data.aws_iam_policy_document.s3_scan_object will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "s3_scan_object" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "sqs:SendMessage",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]
          + sid       = "S3sendToSQS"

          + condition {
              + test     = "ArnEquals"
              + values   = [
                  + "arn:aws:s3:::scan-files-staging-integration-test",
                ]
              + variable = "aws:SourceArn"
            }

          + principals {
              + identifiers = [
                  + "s3.amazonaws.com",
                ]
              + type        = "Service"
            }
        }
      + statement {
          + actions   = [
              + "sqs:DeleteMessage",
              + "sqs:GetQueueAttributes",
              + "sqs:ReceiveMessage",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]
          + sid       = "LambdaTriggerFromSQS"

          + principals {
              + identifiers = [
                  + "arn:aws:iam::127893201980:role/s3-scan-object",
                ]
              + type        = "AWS"
            }
        }
    }

  # module.integration_test.aws_cloudwatch_log_group.s3_scan_object will be destroyed
  # (because aws_cloudwatch_log_group.s3_scan_object is not in configuration)
  - resource "aws_cloudwatch_log_group" "s3_scan_object" {
      - arn               = "arn:aws:logs:ca-central-1:127893201980:log-group:/aws/lambda/s3-scan-object-integration-test" -> null
      - id                = "/aws/lambda/s3-scan-object-integration-test" -> null
      - name              = "/aws/lambda/s3-scan-object-integration-test" -> null
      - retention_in_days = 7 -> null
      - tags              = {
          - "CostCentre" = "scan-files-staging"
          - "Terraform"  = "true"
        } -> null
      - tags_all          = {
          - "CostCentre" = "scan-files-staging"
          - "Terraform"  = "true"
        } -> null
    }

  # module.integration_test.aws_iam_policy.s3_scan_object will be destroyed
  # (because aws_iam_policy.s3_scan_object is not in configuration)
  - resource "aws_iam_policy" "s3_scan_object" {
      - arn       = "arn:aws:iam::127893201980:policy/S3ScanObject-integration-test" -> null
      - id        = "arn:aws:iam::127893201980:policy/S3ScanObject-integration-test" -> null
      - name      = "S3ScanObject-integration-test" -> null
      - path      = "/" -> null
      - policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "logs:PutLogEvents",
                          - "logs:CreateLogStream",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:logs:ca-central-1:127893201980:log-group:/aws/lambda/s3-scan-object-integration-test:log-stream:*",
                          - "arn:aws:logs:ca-central-1:127893201980:log-group:/aws/lambda/s3-scan-object-integration-test",
                        ]
                      - Sid      = ""
                    },
                  - {
                      - Action   = "lambda:InvokeFunction"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:lambda:ca-central-1:127893201980:function:s3-scan-object"
                      - Sid      = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - policy_id = "ANPAR3RYHMQ6I4O5BXDA5" -> null
      - tags      = {} -> null
      - tags_all  = {} -> null
    }

  # module.integration_test.aws_iam_role.s3_scan_object will be destroyed
  # (because aws_iam_role.s3_scan_object is not in configuration)
  - resource "aws_iam_role" "s3_scan_object" {
      - arn                   = "arn:aws:iam::127893201980:role/S3ScanObject-integration-test" -> null
      - assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRole"
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "lambda.amazonaws.com"
                        }
                      - Sid       = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - create_date           = "2022-07-12T18:31:04Z" -> null
      - force_detach_policies = false -> null
      - id                    = "S3ScanObject-integration-test" -> null
      - managed_policy_arns   = [
          - "arn:aws:iam::127893201980:policy/S3ScanObject-integration-test",
        ] -> null
      - max_session_duration  = 3600 -> null
      - name                  = "S3ScanObject-integration-test" -> null
      - path                  = "/" -> null
      - role_last_used        = [
          - {
              - last_used_date = "2023-05-30T18:04:26Z"
              - region         = "ca-central-1"
            },
        ] -> null
      - tags                  = {} -> null
      - tags_all              = {} -> null
      - unique_id             = "AROAR3RYHMQ6GZKMF5CFE" -> null

      - inline_policy {}
    }

  # module.integration_test.aws_iam_role_policy_attachment.s3_scan_object will be destroyed
  # (because aws_iam_role_policy_attachment.s3_scan_object is not in configuration)
  - resource "aws_iam_role_policy_attachment" "s3_scan_object" {
      - id         = "S3ScanObject-integration-test-20220713155505627300000001" -> null
      - policy_arn = "arn:aws:iam::127893201980:policy/S3ScanObject-integration-test" -> null
      - role       = "S3ScanObject-integration-test" -> null
    }

  # module.integration_test.aws_kms_alias.s3_scan_object_queue will be created
  + resource "aws_kms_alias" "s3_scan_object_queue" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + name           = "alias/s3_scan_object_queue"
      + name_prefix    = (known after apply)
      + target_key_arn = (known after apply)
      + target_key_id  = (known after apply)
    }

  # module.integration_test.aws_kms_key.s3_scan_object_queue will be created
  + resource "aws_kms_key" "s3_scan_object_queue" {
      + arn                                = (known after apply)
      + bypass_policy_lockout_safety_check = false
      + customer_master_key_spec           = "SYMMETRIC_DEFAULT"
      + description                        = "S3 scan objects KMS key for SQS queue encryption"
      + enable_key_rotation                = true
      + id                                 = (known after apply)
      + is_enabled                         = true
      + key_id                             = (known after apply)
      + key_usage                          = "ENCRYPT_DECRYPT"
      + multi_region                       = (known after apply)
      + policy                             = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "kms:*"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "arn:aws:iam::127893201980:root"
                        }
                      + Resource  = "*"
                      + Sid       = ""
                    },
                  + {
                      + Action    = [
                          + "kms:GenerateDataKey*",
                          + "kms:Decrypt",
                        ]
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS     = "arn:aws:iam::127893201980:role/s3-scan-object"
                          + Service = "s3.amazonaws.com"
                        }
                      + Resource  = "*"
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + tags                               = {
          + "CostCentre" = "scan-files-staging"
          + "Terraform"  = "true"
        }
      + tags_all                           = {
          + "CostCentre" = "scan-files-staging"
          + "Terraform"  = "true"
        }
    }

  # module.integration_test.aws_lambda_function.s3_scan_object will be destroyed
  # (because aws_lambda_function.s3_scan_object is not in configuration)
  - resource "aws_lambda_function" "s3_scan_object" {
      - architectures                  = [
          - "x86_64",
        ] -> null
      - arn                            = "arn:aws:lambda:ca-central-1:127893201980:function:s3-scan-object-integration-test" -> null
      - filename                       = "/tmp/main.py.zip" -> null
      - function_name                  = "s3-scan-object-integration-test" -> null
      - handler                        = "main.handler" -> null
      - id                             = "s3-scan-object-integration-test" -> null
      - invoke_arn                     = "arn:aws:apigateway:ca-central-1:lambda:path/2015-03-31/functions/arn:aws:lambda:ca-central-1:127893201980:function:s3-scan-object-integration-test/invocations" -> null
      - last_modified                  = "2023-05-24T20:03:42.000+0000" -> null
      - layers                         = [] -> null
      - memory_size                    = 512 -> null
      - package_type                   = "Zip" -> null
      - publish                        = false -> null
      - qualified_arn                  = "arn:aws:lambda:ca-central-1:127893201980:function:s3-scan-object-integration-test:$LATEST" -> null
      - qualified_invoke_arn           = "arn:aws:apigateway:ca-central-1:lambda:path/2015-03-31/functions/arn:aws:lambda:ca-central-1:127893201980:function:s3-scan-object-integration-test:$LATEST/invocations" -> null
      - reserved_concurrent_executions = 10 -> null
      - role                           = "arn:aws:iam::127893201980:role/S3ScanObject-integration-test" -> null
      - runtime                        = "python3.8" -> null
      - skip_destroy                   = false -> null
      - source_code_hash               = "ZD1sYT7qTWBeg/9aMCz7U7W3f9uVOSlAw/cOUOr9sQk=" -> null
      - source_code_size               = 632 -> null
      - tags                           = {
          - "CostCentre" = "scan-files-staging"
          - "Terraform"  = "true"
        } -> null
      - tags_all                       = {
          - "CostCentre" = "scan-files-staging"
          - "Terraform"  = "true"
        } -> null
      - timeout                        = 120 -> null
      - version                        = "$LATEST" -> null

      - environment {
          - variables = {
              - "ACCOUNT_ID"                  = "127893201980"
              - "LOG_LEVEL"                   = "DEBUG"
              - "S3_SCAN_OBJECT_FUNCTION_ARN" = "arn:aws:lambda:ca-central-1:127893201980:function:s3-scan-object"
            } -> null
        }

      - ephemeral_storage {
          - size = 512 -> null
        }

      - tracing_config {
          - mode = "PassThrough" -> null
        }
    }

  # module.integration_test.aws_lambda_permission.s3_execute will be destroyed
  # (because aws_lambda_permission.s3_execute is not in configuration)
  - resource "aws_lambda_permission" "s3_execute" {
      - action        = "lambda:InvokeFunction" -> null
      - function_name = "s3-scan-object-integration-test" -> null
      - id            = "S3ScanObjectS3Invoke-integration-test" -> null
      - principal     = "s3.amazonaws.com" -> null
      - source_arn    = "arn:aws:s3:::scan-files-staging-integration-test" -> null
      - statement_id  = "S3ScanObjectS3Invoke-integration-test" -> null
    }

  # module.integration_test.aws_s3_bucket_notification.s3_scan_object will be updated in-place
  ~ resource "aws_s3_bucket_notification" "s3_scan_object" {
        id          = "scan-files-staging-integration-test"
        # (2 unchanged attributes hidden)

      - lambda_function {
          - events              = [
              - "s3:ObjectCreated:*",
            ] -> null
          - id                  = "ScanObjectCreated" -> null
          - lambda_function_arn = "arn:aws:lambda:ca-central-1:127893201980:function:s3-scan-object-integration-test" -> null
        }

      + queue {
          + events    = [
              + "s3:ObjectCreated:*",
            ]
          + id        = "ScanObjectCreated"
          + queue_arn = (known after apply)
        }
    }

  # module.integration_test.aws_sqs_queue.s3_scan_object will be created
  + resource "aws_sqs_queue" "s3_scan_object" {
      + arn                               = (known after apply)
      + content_based_deduplication       = false
      + deduplication_scope               = (known after apply)
      + delay_seconds                     = 0
      + fifo_queue                        = false
      + fifo_throughput_limit             = (known after apply)
      + id                                = (known after apply)
      + kms_data_key_reuse_period_seconds = (known after apply)
      + kms_master_key_id                 = (known after apply)
      + max_message_size                  = 262144
      + message_retention_seconds         = 345600
      + name                              = "s3-scan-object"
      + name_prefix                       = (known after apply)
      + policy                            = (known after apply)
      + receive_wait_time_seconds         = 0
      + redrive_allow_policy              = (known after apply)
      + redrive_policy                    = (known after apply)
      + sqs_managed_sse_enabled           = (known after apply)
      + tags                              = {
          + "CostCentre" = "scan-files-staging"
          + "Terraform"  = "true"
        }
      + tags_all                          = {
          + "CostCentre" = "scan-files-staging"
          + "Terraform"  = "true"
        }
      + url                               = (known after apply)
      + visibility_timeout_seconds        = 300
    }

  # module.integration_test.aws_sqs_queue_policy.s3_scan_object will be created
  + resource "aws_sqs_queue_policy" "s3_scan_object" {
      + id        = (known after apply)
      + policy    = (known after apply)
      + queue_url = (known after apply)
    }

Plan: 4 to add, 1 to change, 6 to destroy.

Warning: Argument is deprecated

  with module.integration_test_bucket.aws_s3_bucket.this,
  on .terraform/modules/integration_test_bucket/S3/main.tf line 8, in resource "aws_s3_bucket" "this":
   8: resource "aws_s3_bucket" "this" {

Use the aws_s3_bucket_versioning resource instead

(and 4 more similar warnings elsewhere)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"
Releasing state lock. This may take a few moments...

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh

18 tests, 18 passed, 0 warnings, 0 failures, 0 exceptions

```

</details>
